<div class="container ">
    <div class="block">
        <a href="../pages/shop.php"><img style="/*margin-left: 15%;margin-top: 10px;width: 70%;*/ width: 90%;background-color: #364a49;padding: 5%;" class="imgBlock" src="images/телефоны.png" alt=""></a>

         <p class="textBlock">Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст</p>
    </div>
    <div class="block">
        <img style="/*margin-left: 15%;margin-top: 10px;width: 70%;*/width: 90%;background-color: #364a49;padding: 5%;" class="imgBlock" src="images/Телефон.png" alt="">
        <p class="textBlock">Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст</p>
    </div>
    <div class="block">
        <img class="imgBlock" src="images/acsessuaru3.jpg" alt="">
        <p class="textBlock">Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст Проверочный текст</p>
    </div>
</div>